#### Terraform format and style: `success`
#### Terraform initialization: `success`
#### Terraform validation: `success`

<details><summary>Show validation output</summary>

```

$ terraform validate
Success! The configuration is valid.


```

</details>

#### Terraform plan: `success`

<details><summary>Show plan</summary>

```

$ terraform plan
data.aws_availability_zones.available: Reading...
aws_cognito_user_pool.pool: Refreshing state... [id=eu-west-1_w8ryL2viU]
module.eks.module.cluster.aws_cloudwatch_log_group.this[0]: Refreshing state... [id=/aws/eks/gh-v1-cluster/cluster]
module.eks.module.cluster.module.kms.data.aws_caller_identity.current: Reading...
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-01124e41fa6b2f045]
module.eks.data.aws_route53_zone.this[0]: Reading...
module.eks.module.cluster.data.aws_partition.current: Reading...
module.eks.data.aws_region.current: Reading...
module.eks.module.cluster.module.kms.data.aws_partition.current: Reading...
aws_efs_file_system.eks: Refreshing state... [id=fs-00a70b26241e47236]
module.eks.module.cluster.module.kms.data.aws_partition.current: Read complete after 0s [id=aws]
module.eks.module.cluster.data.aws_partition.current: Read complete after 0s [id=aws]
module.eks.data.aws_region.current: Read complete after 0s [id=eu-west-1]
module.eks.module.cluster.data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.eks.module.cluster.data.aws_default_tags.current: Reading...
module.eks.module.cluster.data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2764486067]
module.eks.module.cluster.data.aws_default_tags.current: Read complete after 0s [id=aws]
module.eks.module.cluster.aws_iam_role.this[0]: Refreshing state... [id=gh-v1-cluster-cluster-20221026060504071600000001]
module.eks.module.cluster.data.aws_caller_identity.current: Reading...
module.eks.module.cluster.data.aws_caller_identity.current: Read complete after 0s [id=047488060046]
module.eks.module.cluster.module.kms.data.aws_caller_identity.current: Read complete after 0s [id=047488060046]
data.aws_availability_zones.available: Read complete after 0s [id=eu-west-1]
module.vpc.aws_eip.nat[2]: Refreshing state... [id=eipalloc-036240cb9d1286b16]
module.vpc.aws_eip.nat[1]: Refreshing state... [id=eipalloc-0774121618251f576]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-0152dbe8746e42b7f]
aws_cognito_user_group.argocd_admin_group: Refreshing state... [id=eu-west-1_w8ryL2viU/argocd-admin]
aws_cognito_user_pool_domain.pool_domain: Refreshing state... [id=gh-v1-cluster]
module.eks.module.cluster.aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKSClusterPolicy"]: Refreshing state... [id=gh-v1-cluster-cluster-20221026060504071600000001-20221026060506968500000003]
module.eks.module.cluster.aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKSVPCResourceController"]: Refreshing state... [id=gh-v1-cluster-cluster-20221026060504071600000001-20221026060506955000000002]
module.eks.data.aws_route53_zone.this[0]: Read complete after 1s [id=Z02344701J76N99N4DJK6]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0b70fd8e59cc0b6b1]
module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-05cbb8697c5484c63]
module.vpc.aws_route_table.private[2]: Refreshing state... [id=rtb-0406bfdf973247422]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-04f6764d831ac2334]
module.eks.module.cluster.aws_security_group.node[0]: Refreshing state... [id=sg-0679f3ad2ed348feb]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-09766c46e85e054aa]
module.vpc.aws_subnet.private[2]: Refreshing state... [id=subnet-0e384753f23e205bd]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0198a94acd34a3d45]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0fa5a11474b6559b3]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0b80b3551f4debff5]
module.vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-08e94da892c98bc20]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0c0abfdf6de891fbf]
module.eks.module.cluster.aws_security_group.cluster[0]: Refreshing state... [id=sg-0efb6c87b91e6b76a]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0ebc00ad5dafa9326]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-08076423c42e3a85e]
module.vpc.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-0f08d42989844f1d2]
aws_security_group.efs_eks: Refreshing state... [id=sg-08af7cc7f34bc8e4d]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-09766c46e85e054aa1080289494]
module.eks.module.cluster.aws_security_group_rule.cluster["egress_nodes_kubelet"]: Refreshing state... [id=sgrule-2356149603]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0400e9a535d7a539b]
module.eks.module.cluster.aws_security_group_rule.cluster["egress_nodes_443"]: Refreshing state... [id=sgrule-2532477495]
module.eks.module.cluster.aws_security_group_rule.cluster["ingress_nodes_443"]: Refreshing state... [id=sgrule-1488802584]
module.eks.module.cluster.aws_security_group_rule.cluster["egress_nodes_ephemeral_ports_tcp"]: Refreshing state... [id=sgrule-40410895]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-06fb87aa475492da7]
module.vpc.aws_nat_gateway.this[1]: Refreshing state... [id=nat-00d4740daa3a74814]
module.vpc.aws_nat_gateway.this[2]: Refreshing state... [id=nat-0746d99ba3b2cf983]
module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-06b2eef34695887f6]
module.eks.module.nlb.aws_lb.this[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-1:047488060046:loadbalancer/net/gh-v1-cluster/1a3eb94119f8ed52]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0078e688bf3d0bcc4]
module.eks.module.cluster.aws_security_group_rule.node["ingress_all_http"]: Refreshing state... [id=sgrule-1701334786]
module.eks.module.cluster.aws_security_group_rule.node["egress_ntp_udp"]: Refreshing state... [id=sgrule-2665816354]
module.eks.module.cluster.aws_security_group_rule.node["egress_ntp_tcp"]: Refreshing state... [id=sgrule-3766158383]
module.eks.module.cluster.aws_security_group_rule.node["ingress_cluster_kubelet"]: Refreshing state... [id=sgrule-1343210806]
module.eks.module.cluster.aws_security_group_rule.node["ingress_all_https"]: Refreshing state... [id=sgrule-1478305469]
module.eks.module.cluster.aws_security_group_rule.node["ingress_self_coredns_udp"]: Refreshing state... [id=sgrule-2064606780]
module.eks.module.cluster.aws_security_group_rule.node["egress_all"]: Refreshing state... [id=sgrule-22955309]
module.eks.module.cluster.aws_security_group_rule.node["egress_self_coredns_tcp"]: Refreshing state... [id=sgrule-1942459302]
module.eks.module.cluster.aws_security_group_rule.node["ingress_cluster_443"]: Refreshing state... [id=sgrule-1287850232]
module.eks.module.cluster.aws_security_group_rule.node["egress_self_coredns_udp"]: Refreshing state... [id=sgrule-4255125952]
module.eks.module.cluster.aws_security_group_rule.node["ingress_self_coredns_tcp"]: Refreshing state... [id=sgrule-3746612691]
module.eks.module.cluster.aws_security_group_rule.node["ingress_self_all"]: Refreshing state... [id=sgrule-125041347]
module.eks.module.cluster.aws_security_group_rule.node["egress_cluster_443"]: Refreshing state... [id=sgrule-142167629]
module.eks.module.cluster.aws_security_group_rule.node["egress_https"]: Refreshing state... [id=sgrule-1067792689]
module.eks.module.cluster.aws_security_group_rule.node["ingress_cluster_to_nodes_metrics_server"]: Refreshing state... [id=sgrule-1959138402]
aws_efs_mount_target.eks[1]: Refreshing state... [id=fsmt-0fa8c1c0905ba2111]
aws_efs_mount_target.eks[2]: Refreshing state... [id=fsmt-02e5963c5d167f1a3]
aws_efs_mount_target.eks[0]: Refreshing state... [id=fsmt-01bda35e02f5e194f]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-04f6764d831ac23341080289494]
module.vpc.aws_route.private_nat_gateway[1]: Refreshing state... [id=r-rtb-05cbb8697c5484c631080289494]
module.vpc.aws_route.private_nat_gateway[2]: Refreshing state... [id=r-rtb-0406bfdf9732474221080289494]
module.eks.module.cluster.aws_eks_cluster.this[0]: Refreshing state... [id=gh-v1-cluster]
module.eks.module.nlb.aws_lb_target_group.main[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-1:047488060046:targetgroup/gh-v120221026060848439800000006/6729fb1843b3ea87]
module.eks.data.dns_a_record_set.nlb: Reading...
module.eks.aws_route53_record.wildcard[0]: Refreshing state... [id=Z02344701J76N99N4DJK6_*.apps.gh-v1-cluster_CNAME]
module.eks.module.nlb.aws_lb_target_group.main[1]: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-1:047488060046:targetgroup/gh-v120221026060848440600000007/e2425b466c0ae853]
module.eks.data.dns_a_record_set.nlb: Read complete after 0s [id=gh-v1-cluster-1a3eb94119f8ed52.elb.eu-west-1.amazonaws.com]
module.eks.module.cluster.data.tls_certificate.this[0]: Reading...
module.eks.data.aws_eks_cluster_auth.cluster: Reading...
module.eks.data.aws_eks_cluster_auth.cluster: Read complete after 0s [id=gh-v1-cluster]
module.eks.data.aws_iam_policy_document.cluster_autoscaler: Reading...
module.eks.data.aws_iam_policy_document.cluster_autoscaler: Read complete after 0s [id=98148458]
module.eks.module.cluster.data.tls_certificate.this[0]: Read complete after 0s [id=a5615580cbd9272bdae2e3906bc02344ec342de6]
module.eks.module.cluster.aws_iam_openid_connect_provider.oidc_provider[0]: Refreshing state... [id=arn:aws:iam::047488060046:oidc-provider/oidc.eks.eu-west-1.amazonaws.com/id/D7DC5E8CB4D65FF7923BA5975B6622E3]
module.eks.module.nlb.aws_lb_listener.frontend_http_tcp[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-1:047488060046:listener/net/gh-v1-cluster/1a3eb94119f8ed52/acd3c6d94d92f69d]
module.eks.module.nlb.aws_lb_listener.frontend_http_tcp[1]: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-1:047488060046:listener/net/gh-v1-cluster/1a3eb94119f8ed52/dc24e12a5a577852]
module.eks.module.cluster.module.self_managed_node_group["gh-v1-cluster-main"].data.aws_caller_identity.current: Reading...
module.eks.module.cluster.module.self_managed_node_group["gh-v1-cluster-main"].data.aws_default_tags.current: Reading...
module.eks.module.cluster.module.self_managed_node_group["gh-v1-cluster-main"].data.aws_partition.current: Reading...
module.eks.module.cluster.module.self_managed_node_group["gh-v1-cluster-main"].data.aws_partition.current: Read complete after 0s [id=aws]
module.eks.module.cluster.module.self_managed_node_group["gh-v1-cluster-main"].data.aws_default_tags.current: Read complete after 0s [id=aws]
module.eks.module.cluster.module.self_managed_node_group["gh-v1-cluster-main"].data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.eks.module.cluster.module.self_managed_node_group["gh-v1-cluster-main"].data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2560088296]
module.eks.module.cluster.module.self_managed_node_group["gh-v1-cluster-main"].data.aws_ami.eks_default[0]: Reading...
module.eks.module.cluster.module.self_managed_node_group["gh-v1-cluster-main"].aws_iam_role.this[0]: Refreshing state... [id=gh-v1-cluster-main-node-group-20221026060852136400000008]
module.eks.module.cluster.module.self_managed_node_group["gh-v1-cluster-main"].data.aws_caller_identity.current: Read complete after 0s [id=047488060046]
module.eks.module.cluster.module.self_managed_node_group["gh-v1-cluster-main"].data.aws_ami.eks_default[0]: Read complete after 0s [id=ami-00447576335dc0922]
module.eks.module.cluster.module.self_managed_node_group["gh-v1-cluster-main"].aws_iam_instance_profile.this[0]: Refreshing state... [id=gh-v1-cluster-main-node-group-20221026060854006500000009]
module.eks.module.cluster.module.self_managed_node_group["gh-v1-cluster-main"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"]: Refreshing state... [id=gh-v1-cluster-main-node-group-20221026060852136400000008-2022102606085437910000000c]
module.eks.module.cluster.module.self_managed_node_group["gh-v1-cluster-main"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"]: Refreshing state... [id=gh-v1-cluster-main-node-group-20221026060852136400000008-2022102606085435370000000a]
module.eks.module.cluster.module.self_managed_node_group["gh-v1-cluster-main"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"]: Refreshing state... [id=gh-v1-cluster-main-node-group-20221026060852136400000008-2022102606085435740000000b]
module.eks.module.cluster.module.self_managed_node_group["gh-v1-cluster-main"].aws_launch_template.this[0]: Refreshing state... [id=lt-05d1c768dfef1f262]
module.eks.module.cluster.module.self_managed_node_group["gh-v1-cluster-main"].aws_autoscaling_group.this[0]: Refreshing state... [id=gh-v1-cluster-main-2022102606172062370000000f]
module.eks.module.cluster.kubernetes_config_map.aws_auth[0]: Refreshing state... [id=kube-system/aws-auth]
module.eks.module.cluster.kubernetes_config_map_v1_data.aws_auth[0]: Refreshing state... [id=kube-system/aws-auth]
module.argocd_bootstrap.time_static.iat: Refreshing state... [id=2022-10-26T06:17:41Z]
module.argocd_bootstrap.random_password.argocd_server_admin: Refreshing state... [id=none]
module.oidc.data.aws_region.current: Reading...
module.argocd_bootstrap.random_password.argocd_server_secretkey: Refreshing state... [id=none]
module.argocd_bootstrap.random_uuid.jti: Refreshing state... [id=b910b11b-d7a8-648e-e274-2fcfe9431ae1]
module.argocd_bootstrap.random_password.oauth2_cookie_secret: Refreshing state... [id=none]
module.oidc.aws_cognito_user_pool_client.client: Refreshing state... [id=3t7k2brrenpkkgijrkica0rsdb]
module.oidc.null_resource.dependencies: Refreshing state... [id=1547636024654875203]
module.oidc.data.aws_region.current: Read complete after 0s [id=eu-west-1]
module.argocd_bootstrap.htpasswd_password.argocd_server_admin: Refreshing state... [id=PW2432612431302461556e326e783158796d48356b5a444b78434e562f653956496f787a466a4a4d384d74722e5661395a4d304f6f726d687a422f4b71]
module.argocd_bootstrap.jwt_hashed_token.argocd: Refreshing state... [id={"iat":1666765061,"iss":"argocd","jti":"b910b11b-d7a8-648e-e274-2fcfe9431ae1","nbf":1666765061,"sub":"pipeline"}]
module.argocd_bootstrap.data.utils_deep_merge_yaml.values: Reading...
module.argocd_bootstrap.data.utils_deep_merge_yaml.values: Read complete after 0s [id=7362de4b600781d99c65040a0c3b987e5172d4d7]
module.argocd_bootstrap.helm_release.argocd: Refreshing state... [id=argocd]
module.oidc.null_resource.this: Refreshing state... [id=6902570122590685376]
module.argocd_bootstrap.null_resource.this: Refreshing state... [id=8451471995733498298]
module.thanos.data.aws_region.current: Reading...
module.thanos.data.aws_region.current: Read complete after 0s [id=eu-west-1]
module.thanos.module.iam_assumable_role_thanos.data.aws_caller_identity.current: Reading...
module.thanos.module.thanos.argocd_project.this: Refreshing state... [id=thanos]
module.thanos.aws_s3_bucket.thanos_metrics_store: Refreshing state... [id=thanos-metrics-store-gh-v1-cluster]
module.efs.data.utils_deep_merge_yaml.values: Reading...
module.thanos.module.iam_assumable_role_thanos.data.aws_partition.current: Reading...
module.efs.argocd_project.this: Refreshing state... [id=efs-csi-driver]
module.ingress.module.traefik.module.traefik.argocd_project.this: Refreshing state... [id=traefik]
module.efs.data.utils_deep_merge_yaml.values: Read complete after 0s [id=6be51f495f4964a9ed0e3c1832429a3c2a70b53e]
module.thanos.module.iam_assumable_role_thanos.data.aws_partition.current: Read complete after 0s [id=aws]
module.thanos.module.thanos.random_password.oauth2_cookie_secret: Refreshing state... [id=none]
module.ingress.module.traefik.module.traefik.data.utils_deep_merge_yaml.values: Reading...
module.ingress.module.traefik.module.traefik.data.utils_deep_merge_yaml.values: Read complete after 0s [id=6f67cfb1d4a75717435bf31bf92b7fd4c4022d35]
module.ingress.module.traefik.module.traefik.null_resource.dependencies: Refreshing state... [id=2267520950021390830]
module.thanos.module.iam_assumable_role_thanos.data.aws_caller_identity.current: Read complete after 0s [id=047488060046]
module.thanos.module.thanos.null_resource.dependencies: Refreshing state... [id=2401975945002650052]
module.thanos.module.iam_assumable_role_thanos.data.aws_iam_policy_document.assume_role_with_oidc[0]: Reading...
module.thanos.module.iam_assumable_role_thanos.data.aws_iam_policy_document.assume_role_with_oidc[0]: Read complete after 0s [id=1978013597]
module.thanos.module.iam_assumable_role_thanos.aws_iam_role.this[0]: Refreshing state... [id=thanos-s3-role-gh-v1-cluster]
module.ingress.module.traefik.module.traefik.argocd_application.this: Refreshing state... [id=traefik]
module.ingress.module.traefik.module.traefik.null_resource.this: Refreshing state... [id=2318682771607313530]
module.efs.argocd_application.this: Refreshing state... [id=efs-csi-driver]
module.thanos.module.thanos.data.utils_deep_merge_yaml.values: Reading...
module.thanos.module.thanos.data.utils_deep_merge_yaml.values: Read complete after 0s [id=e1e67382d84727022cc58ae131497c29513143ce]
module.thanos.module.thanos.argocd_application.this: Refreshing state... [id=thanos]
module.thanos.data.aws_iam_policy_document.thanos_s3_policy: Reading...
module.thanos.data.aws_iam_policy_document.thanos_s3_policy: Read complete after 0s [id=1984941940]
module.thanos.aws_iam_policy.thanos_s3_policy: Refreshing state... [id=arn:aws:iam::047488060046:policy/thanos-s3-20221026061917935800000010]
module.thanos.module.thanos.null_resource.this: Refreshing state... [id=6768957083259862849]
module.thanos.module.iam_assumable_role_thanos.aws_iam_role_policy_attachment.custom[0]: Refreshing state... [id=thanos-s3-role-gh-v1-cluster-20221026061919192000000011]
module.prometheus-stack.module.kube-prometheus-stack.argocd_project.this: Refreshing state... [id=kube-prometheus-stack]
module.prometheus-stack.module.kube-prometheus-stack.null_resource.dependencies: Refreshing state... [id=8219277364723472454]
module.prometheus-stack.module.kube-prometheus-stack.random_password.grafana_admin_password: Refreshing state... [id=none]
module.prometheus-stack.module.kube-prometheus-stack.random_password.oauth2_cookie_secret: Refreshing state... [id=none]
module.prometheus-stack.module.kube-prometheus-stack.argocd_application.this: Refreshing state... [id=kube-prometheus-stack]
module.prometheus-stack.module.kube-prometheus-stack.null_resource.this: Refreshing state... [id=5357714537191399277]
module.prometheus-stack.module.kube-prometheus-stack.kubernetes_secret.thanos_s3_bucket_secret[0]: Refreshing state... [id=kube-prometheus-stack/thanos-objectstorage]
module.cert-manager.module.cert-manager.argocd_project.this: Refreshing state... [id=cert-manager]
module.loki-stack.aws_s3_bucket.loki: Refreshing state... [id=terraform-20221026062129777100000012]
module.loki-stack.module.loki-stack.argocd_project.this: Refreshing state... [id=loki-stack]
module.cert-manager.aws_iam_policy.cert_manager["is-sandbox.camptocamp.com"]: Refreshing state... [id=arn:aws:iam::047488060046:policy/cert-manager20221026062131462500000013]
module.cert-manager.module.cert-manager.null_resource.dependencies: Refreshing state... [id=9042334501797846721]
module.loki-stack.module.loki-stack.null_resource.dependencies: Refreshing state... [id=5340850951291533045]
module.cert-manager.module.iam_assumable_role_cert_manager[0].aws_iam_role.this[0]: Refreshing state... [id=cert-manager-gh-v1-cluster]
module.loki-stack.module.iam_assumable_role_loki.aws_iam_role.this[0]: Refreshing state... [id=loki-gh-v1-cluster]
module.cert-manager.module.iam_assumable_role_cert_manager[0].aws_iam_role_policy_attachment.custom[0]: Refreshing state... [id=cert-manager-gh-v1-cluster-20221026062132706900000014]
module.cert-manager.module.cert-manager.argocd_application.this: Refreshing state... [id=cert-manager]
module.cert-manager.module.cert-manager.null_resource.this: Refreshing state... [id=6929983489734698058]
module.loki-stack.aws_iam_policy.loki: Refreshing state... [id=arn:aws:iam::047488060046:policy/loki20221026062140787200000015]
module.loki-stack.module.loki-stack.argocd_application.this: Refreshing state... [id=loki-stack]
module.loki-stack.module.iam_assumable_role_loki.aws_iam_role_policy_attachment.custom[0]: Refreshing state... [id=loki-gh-v1-cluster-20221026062142068700000016]
module.loki-stack.module.loki-stack.null_resource.this: Refreshing state... [id=3308177464192162025]
module.grafana.random_password.grafana_admin_password: Refreshing state... [id=none]
module.grafana.random_password.oauth2_cookie_secret: Refreshing state... [id=none]
module.grafana.argocd_project.this: Refreshing state... [id=grafana]
module.grafana.null_resource.dependencies: Refreshing state... [id=5092703596078471978]
module.grafana.argocd_application.this: Refreshing state... [id=grafana]
module.grafana.null_resource.this: Refreshing state... [id=3147348924816060159]
module.argocd.argocd_project.this: Refreshing state... [id=argocd]
module.argocd.null_resource.dependencies: Refreshing state... [id=5855357209772710479]
module.argocd.argocd_application.this: Refreshing state... [id=argocd]
module.argocd.null_resource.this: Refreshing state... [id=8333310854458548832]
module.helloworld_apps.argocd_project.this: Refreshing state... [id=helloworld-apps]
module.metrics_server.argocd_project.this: Refreshing state... [id=metrics-server]
module.metrics_server.argocd_application.this: Refreshing state... [id=metrics-server]
module.helloworld_apps.argocd_application.this: Refreshing state... [id=helloworld-apps]
module.metrics_server.null_resource.this: Refreshing state... [id=9013644932075761956]
module.helloworld_apps.null_resource.this: Refreshing state... [id=7140487243878507894]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.vpc.aws_eip.nat[0] has changed
  ~ resource "aws_eip" "nat" {
      + association_id       = "eipassoc-08a835075c5fe1c5e"
        id                   = "eipalloc-0152dbe8746e42b7f"
      + network_interface    = "eni-061073d034764f599"
      + private_dns          = "ip-10-56-4-71.eu-west-1.compute.internal"
      + private_ip           = "10.56.4.71"
        tags                 = {
            "Name" = "gh-v1-cluster-eu-west-1a"
        }
        # (8 unchanged attributes hidden)
    }

  # module.vpc.aws_eip.nat[1] has changed
  ~ resource "aws_eip" "nat" {
      + association_id       = "eipassoc-0e288148a7f77fe55"
        id                   = "eipalloc-0774121618251f576"
      + network_interface    = "eni-09cb1fff796831b61"
      + private_dns          = "ip-10-56-5-130.eu-west-1.compute.internal"
      + private_ip           = "10.56.5.130"
        tags                 = {
            "Name" = "gh-v1-cluster-eu-west-1b"
        }
        # (8 unchanged attributes hidden)
    }

  # module.vpc.aws_eip.nat[2] has changed
  ~ resource "aws_eip" "nat" {
      + association_id       = "eipassoc-096931f45b60f5842"
        id                   = "eipalloc-036240cb9d1286b16"
      + network_interface    = "eni-05a9dbcd3f0a0da47"
      + private_dns          = "ip-10-56-6-143.eu-west-1.compute.internal"
      + private_ip           = "10.56.6.143"
        tags                 = {
            "Name" = "gh-v1-cluster-eu-west-1c"
        }
        # (8 unchanged attributes hidden)
    }

  # module.vpc.aws_route_table.private[0] has changed
  ~ resource "aws_route_table" "private" {
        id               = "rtb-04f6764d831ac2334"
      ~ route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = ""
              + instance_id                = ""
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = "nat-06fb87aa475492da7"
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
        tags             = {
            "Name" = "gh-v1-cluster-private-eu-west-1a"
        }
        # (5 unchanged attributes hidden)
    }

  # module.vpc.aws_route_table.private[1] has changed
  ~ resource "aws_route_table" "private" {
        id               = "rtb-05cbb8697c5484c63"
      ~ route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = ""
              + instance_id                = ""
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = "nat-00d4740daa3a74814"
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
        tags             = {
            "Name" = "gh-v1-cluster-private-eu-west-1b"
        }
        # (5 unchanged attributes hidden)
    }

  # module.vpc.aws_route_table.private[2] has changed
  ~ resource "aws_route_table" "private" {
        id               = "rtb-0406bfdf973247422"
      ~ route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = ""
              + instance_id                = ""
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = "nat-0746d99ba3b2cf983"
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
        tags             = {
            "Name" = "gh-v1-cluster-private-eu-west-1c"
        }
        # (5 unchanged attributes hidden)
    }

  # module.vpc.aws_route_table.public[0] has changed
  ~ resource "aws_route_table" "public" {
        id               = "rtb-09766c46e85e054aa"
      ~ route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = "igw-0fa5a11474b6559b3"
              + instance_id                = ""
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = ""
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
        tags             = {
            "Name" = "gh-v1-cluster-public"
        }
        # (5 unchanged attributes hidden)
    }

  # module.cert-manager.module.iam_assumable_role_cert_manager[0].aws_iam_role.this[0] has changed
  ~ resource "aws_iam_role" "this" {
        id                    = "cert-manager-gh-v1-cluster"
      ~ managed_policy_arns   = [
          + "arn:aws:iam::047488060046:policy/cert-manager20221026062131462500000013",
        ]
        name                  = "cert-manager-gh-v1-cluster"
      + tags                  = {}
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.eks.module.nlb.aws_lb_listener.frontend_http_tcp[0] has changed
  ~ resource "aws_lb_listener" "frontend_http_tcp" {
        id                = "arn:aws:elasticloadbalancing:eu-west-1:047488060046:listener/net/gh-v1-cluster/1a3eb94119f8ed52/acd3c6d94d92f69d"
      + tags              = {}
        # (5 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.eks.module.nlb.aws_lb_listener.frontend_http_tcp[1] has changed
  ~ resource "aws_lb_listener" "frontend_http_tcp" {
        id                = "arn:aws:elasticloadbalancing:eu-west-1:047488060046:listener/net/gh-v1-cluster/1a3eb94119f8ed52/dc24e12a5a577852"
      + tags              = {}
        # (5 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.loki-stack.module.iam_assumable_role_loki.aws_iam_role.this[0] has changed
  ~ resource "aws_iam_role" "this" {
        id                    = "loki-gh-v1-cluster"
      ~ managed_policy_arns   = [
          + "arn:aws:iam::047488060046:policy/loki20221026062140787200000015",
        ]
        name                  = "loki-gh-v1-cluster"
      + tags                  = {}
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.thanos.module.iam_assumable_role_thanos.aws_iam_role.this[0] has changed
  ~ resource "aws_iam_role" "this" {
        id                    = "thanos-s3-role-gh-v1-cluster"
      ~ managed_policy_arns   = [
          + "arn:aws:iam::047488060046:policy/thanos-s3-20221026061917935800000010",
        ]
        name                  = "thanos-s3-role-gh-v1-cluster"
      + tags                  = {}
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.argocd.data.utils_deep_merge_yaml.values will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "utils_deep_merge_yaml" "values" {
      + id     = (known after apply)
      + input  = (sensitive)
      + output = (known after apply)
    }

  # module.argocd.argocd_application.this will be updated in-place
  ~ resource "argocd_application" "this" {
        id      = "argocd"
        # (2 unchanged attributes hidden)

      ~ spec {
            # (2 unchanged attributes hidden)

          ~ source {
                # (3 unchanged attributes hidden)

              ~ helm {
                  ~ values      = <<-EOT
                        argo-cd:
                          configs:
                            secret:
                              argocdServerAdminPassword: $2a$10$aUn2nx1XymH5kZDKxCNV/e9VIoxzFjJM8Mtr.Va9ZM0OormhzB/Kq
                              argocdServerAdminPasswordMtime: "2020-07-23T11:31:23Z"
                              extra:
                                accounts.pipeline.tokens: '[{"iat":1666765061,"id":"b910b11b-d7a8-648e-e274-2fcfe9431ae1"}]'
                                oidc.default.clientSecret: 120tunnu16bgb4brbqi0coh6of1bq7cvv6s2h8g1q1gqgmlphbl9
                                server.secretkey: 8956JEmOENYeGmTMKJxqdd1AcVxwD1Lt
                          controller:
                            metrics:
                              enabled: true
                          dex:
                            enabled: false
                          repoServer:
                            metrics:
                              enabled: true
                          server:
                            config:
                              accounts.pipeline: apiKey
                              admin.enabled: "false"
                              configManagementPlugins: |
                                - name: kustomized-helm
                                  init:
                                    command: ["/bin/sh", "-c"]
                                    args: ["helm dependency build || true"]
                                  generate:
                                    command: ["/bin/sh", "-c"]
                                    args: ["echo \"$HELM_VALUES\" | helm template . --name-template $ARGOCD_APP_NAME --namespace $ARGOCD_APP_NAMESPACE $HELM_ARGS -f - --include-crds > all.yaml && kustomize build"]
                              oidc.config: |+
                                "clientID": "3t7k2brrenpkkgijrkica0rsdb"
                                "clientSecret": "$oidc.default.clientSecret"
                                "issuer": "https://cognito-idp.eu-west-1.amazonaws.com/eu-west-1_w8ryL2viU"
                                "name": "OIDC"
                                "requestedIDTokenClaims":
                                  "groups":
                                    "essential": true
                                "requestedScopes":
                                - "openid"
                                - "profile"
                                - "email"
                        
                              resource.customizations: |
                                argoproj.io/Application:
                                  health.lua: |
                                    hs = {}
                                    hs.status = "Progressing"
                                    hs.message = ""
                                    if obj.status ~= nil then
                                      if obj.status.health ~= nil then
                                        hs.status = obj.status.health.status
                                        if obj.status.health.message ~= nil then
                                          hs.message = obj.status.health.message
                                        end
                                      end
                                    end
                                    return hs
                                networking.k8s.io/Ingress:
                                  health.lua: |
                                    hs = {}
                                    hs.status = "Healthy"
                                    return hs
                              url: https://argocd.apps.gh-v1-cluster.is-sandbox.camptocamp.com
                            extraArgs:
                            - --insecure
                            ingress:
                              annotations:
                                cert-manager.io/cluster-issuer: letsencrypt-staging
                                ingress.kubernetes.io/ssl-redirect: "true"
                                kubernetes.io/ingress.allow-http: "false"
                                traefik.ingress.kubernetes.io/router.entrypoints: websecure
                                traefik.ingress.kubernetes.io/router.middlewares: traefik-withclustername@kubernetescrd
                                traefik.ingress.kubernetes.io/router.tls: "true"
                              enabled: true
                              hosts:
                              - argocd.apps.gh-v1-cluster.is-sandbox.camptocamp.com
                              - argocd.apps.is-sandbox.camptocamp.com
                              tls:
                              - hosts:
                                - argocd.apps.gh-v1-cluster.is-sandbox.camptocamp.com
                                - argocd.apps.is-sandbox.camptocamp.com
                                secretName: argocd-tls
                            metrics:
                              enabled: true
                            rbacConfig:
                              policy.csv: |
                                g, pipeline, role:admin
                                g, argocd-admin, role:admin
                              policy.default: ""
                              scopes: '[groups, cognito:groups, roles]'
                    EOT -> (known after apply)
                    # (2 unchanged attributes hidden)
                }
            }

            # (2 unchanged blocks hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.argocd.null_resource.dependencies will be updated in-place
  ~ resource "null_resource" "dependencies" {
        id       = "5855357209772710479"
      + triggers = {}
    }

  # module.cert-manager.data.aws_iam_policy_document.cert_manager["is-sandbox.camptocamp.com"] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "cert_manager" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "route53:ListHostedZonesByName",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "route53:ChangeResourceRecordSets",
              + "route53:ListResourceRecordSets",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "route53:GetChange",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:route53:::change/*",
            ]
        }
    }

  # module.cert-manager.data.aws_region.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_region" "current" {
      + description = (known after apply)
      + endpoint    = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
    }

  # module.cert-manager.data.aws_route53_zone.this["is-sandbox.camptocamp.com"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_route53_zone" "this" {
      + arn                        = (known after apply)
      + caller_reference           = (known after apply)
      + comment                    = (known after apply)
      + id                         = (known after apply)
      + linked_service_description = (known after apply)
      + linked_service_principal   = (known after apply)
      + name                       = "is-sandbox.camptocamp.com"
      + name_servers               = (known after apply)
      + resource_record_set_count  = (known after apply)
      + tags                       = (known after apply)
      + vpc_id                     = (known after apply)
      + zone_id                    = (known after apply)
    }

  # module.cert-manager.aws_iam_policy.cert_manager["is-sandbox.camptocamp.com"] will be updated in-place
  ~ resource "aws_iam_policy" "cert_manager" {
        id          = "arn:aws:iam::047488060046:policy/cert-manager20221026062131462500000013"
        name        = "cert-manager20221026062131462500000013"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "route53:ListHostedZonesByName"
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "route53:ListResourceRecordSets",
                          - "route53:ChangeResourceRecordSets",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:route53:::hostedzone/Z02344701J76N99N4DJK6"
                      - Sid      = ""
                    },
                  - {
                      - Action   = "route53:GetChange"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:route53:::change/*"
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags        = {}
        # (6 unchanged attributes hidden)
    }

  # module.efs.argocd_application.this will be updated in-place
  ~ resource "argocd_application" "this" {
        id      = "efs-csi-driver"
        # (2 unchanged attributes hidden)

      ~ spec {
            # (2 unchanged attributes hidden)

          ~ sync_policy {
              ~ automated    = {
                  - "allow_empty" = false -> null
                    # (2 unchanged elements hidden)
                }
                # (1 unchanged attribute hidden)
            }

            # (2 unchanged blocks hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.grafana.data.utils_deep_merge_yaml.values will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "utils_deep_merge_yaml" "values" {
      + id     = (known after apply)
      + input  = [
          + (sensitive),
        ]
      + output = (known after apply)
    }

  # module.grafana.argocd_application.this will be updated in-place
  ~ resource "argocd_application" "this" {
        id      = "grafana"
        # (2 unchanged attributes hidden)

      ~ spec {
            # (2 unchanged attributes hidden)

          ~ source {
                # (3 unchanged attributes hidden)

              ~ helm {
                  ~ values      = <<-EOT
                        grafana:
                          adminPassword: f7lQREVjPXt114RD
                          grafana.ini:
                            auth.generic_oauth:
                              allow_sign_up: true
                              api_url: https://gh-v1-cluster.auth.eu-west-1.amazoncognito.com/oauth2/userInfo
                              auth_url: https://gh-v1-cluster.auth.eu-west-1.amazoncognito.com/oauth2/authorize
                              client_id: 3t7k2brrenpkkgijrkica0rsdb
                              client_secret: 120tunnu16bgb4brbqi0coh6of1bq7cvv6s2h8g1q1gqgmlphbl9
                              enabled: true
                              scopes: openid profile email
                              token_url: https://gh-v1-cluster.auth.eu-west-1.amazoncognito.com/oauth2/token
                            server:
                              domain: grafana.apps.gh-v1-cluster.is-sandbox.camptocamp.com
                              root_url: https://%(domain)s
                            users:
                              auto_assign_org_role: Editor
                          ingress:
                            annotations:
                              cert-manager.io/cluster-issuer: letsencrypt-staging
                              ingress.kubernetes.io/ssl-redirect: "true"
                              kubernetes.io/ingress.allow-http: "false"
                              traefik.ingress.kubernetes.io/router.entrypoints: websecure
                              traefik.ingress.kubernetes.io/router.middlewares: traefik-withclustername@kubernetescrd
                              traefik.ingress.kubernetes.io/router.tls: "true"
                            enabled: true
                            hosts:
                            - grafana.apps.gh-v1-cluster.is-sandbox.camptocamp.com
                            - grafana.apps.is-sandbox.camptocamp.com
                            tls:
                            - hosts:
                              - grafana.apps.gh-v1-cluster.is-sandbox.camptocamp.com
                              - grafana.apps.is-sandbox.camptocamp.com
                              secretName: grafana-tls
                    EOT -> (known after apply)
                    # (2 unchanged attributes hidden)
                }
            }

            # (2 unchanged blocks hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.grafana.null_resource.dependencies will be updated in-place
  ~ resource "null_resource" "dependencies" {
        id       = "5092703596078471978"
      + triggers = {}
    }

  # module.loki-stack.data.aws_iam_policy_document.loki will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "loki" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "s3:DeleteObject",
              + "s3:GetObject",
              + "s3:ListBucket",
              + "s3:PutObject",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:s3:::terraform-20221026062129777100000012",
              + "arn:aws:s3:::terraform-20221026062129777100000012/*",
            ]
        }
    }

  # module.loki-stack.data.aws_region.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_region" "current" {
      + description = (known after apply)
      + endpoint    = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
    }

  # module.loki-stack.aws_iam_policy.loki will be updated in-place
  ~ resource "aws_iam_policy" "loki" {
        id          = "arn:aws:iam::047488060046:policy/loki20221026062140787200000015"
        name        = "loki20221026062140787200000015"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "s3:PutObject",
                          - "s3:ListBucket",
                          - "s3:GetObject",
                          - "s3:DeleteObject",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::terraform-20221026062129777100000012/*",
                          - "arn:aws:s3:::terraform-20221026062129777100000012",
                        ]
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags        = {}
        # (6 unchanged attributes hidden)
    }

  # module.metrics_server.data.utils_deep_merge_yaml.values will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "utils_deep_merge_yaml" "values" {
      + id     = (known after apply)
      + input  = []
      + output = (known after apply)
    }

  # module.metrics_server.argocd_application.this will be updated in-place
  ~ resource "argocd_application" "this" {
        id      = "metrics-server"
        # (2 unchanged attributes hidden)

      ~ spec {
            # (2 unchanged attributes hidden)

          ~ source {
              ~ target_revision = "master" -> "metrics-server-helm-chart-3.8.2"
                # (2 unchanged attributes hidden)

              ~ helm {
                  ~ values      = jsonencode({}) -> (known after apply)
                    # (2 unchanged attributes hidden)
                }
            }

            # (2 unchanged blocks hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.oidc.null_resource.dependencies will be updated in-place
  ~ resource "null_resource" "dependencies" {
        id       = "1547636024654875203"
      + triggers = {}
    }

  # module.cert-manager.module.cert-manager.data.utils_deep_merge_yaml.values will be read during apply
  # (config refers to values not yet known)
 <= data "utils_deep_merge_yaml" "values" {
      + id     = (known after apply)
      + input  = [
          + (known after apply),
        ]
      + output = (known after apply)
    }

  # module.cert-manager.module.cert-manager.argocd_application.this will be updated in-place
  ~ resource "argocd_application" "this" {
        id      = "cert-manager"
        # (2 unchanged attributes hidden)

      ~ spec {
            # (2 unchanged attributes hidden)

          ~ source {
                # (3 unchanged attributes hidden)

              ~ helm {
                  ~ values      = <<-EOT
                        cert-manager:
                          clusterIssuers:
                            acme:
                              solvers:
                              - dns01:
                                  route53:
                                    region: eu-west-1
                                selector:
                                  dnsZones:
                                  - is-sandbox.camptocamp.com
                              - http01:
                                  ingress: {}
                            letsencrypt:
                              enabled: true
                          serviceAccount:
                            annotations:
                              eks.amazonaws.com/role-arn: arn:aws:iam::047488060046:role/cert-manager-gh-v1-cluster
                    EOT -> (known after apply)
                    # (2 unchanged attributes hidden)
                }
            }

            # (3 unchanged blocks hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.cert-manager.module.cert-manager.null_resource.dependencies will be updated in-place
  ~ resource "null_resource" "dependencies" {
        id       = "9042334501797846721"
      + triggers = {}
    }

  # module.cert-manager.module.iam_assumable_role_cert_manager[0].data.aws_caller_identity.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_caller_identity" "current" {
      + account_id = (known after apply)
      + arn        = (known after apply)
      + id         = (known after apply)
      + user_id    = (known after apply)
    }

  # module.cert-manager.module.iam_assumable_role_cert_manager[0].data.aws_iam_policy_document.assume_role_with_oidc[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "assume_role_with_oidc" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRoleWithWebIdentity",
            ]
          + effect  = "Allow"

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "system:serviceaccount:cert-manager:cert-manager",
                ]
              + variable = "oidc.eks.eu-west-1.amazonaws.com/id/D7DC5E8CB4D65FF7923BA5975B6622E3:sub"
            }

          + principals {
              + identifiers = [
                  + (known after apply),
                ]
              + type        = "Federated"
            }
        }
    }

  # module.cert-manager.module.iam_assumable_role_cert_manager[0].data.aws_partition.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_partition" "current" {
      + dns_suffix         = (known after apply)
      + id                 = (known after apply)
      + partition          = (known after apply)
      + reverse_dns_prefix = (known after apply)
    }

  # module.cert-manager.module.iam_assumable_role_cert_manager[0].aws_iam_role.this[0] will be updated in-place
  ~ resource "aws_iam_role" "this" {
      ~ assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRoleWithWebIdentity"
                      - Condition = {
                          - StringEquals = {
                              - "oidc.eks.eu-west-1.amazonaws.com/id/D7DC5E8CB4D65FF7923BA5975B6622E3:sub" = "system:serviceaccount:cert-manager:cert-manager"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Federated = "arn:aws:iam::047488060046:oidc-provider/oidc.eks.eu-west-1.amazonaws.com/id/D7DC5E8CB4D65FF7923BA5975B6622E3"
                        }
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        id                    = "cert-manager-gh-v1-cluster"
        name                  = "cert-manager-gh-v1-cluster"
        tags                  = {}
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.loki-stack.module.iam_assumable_role_loki.data.aws_caller_identity.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_caller_identity" "current" {
      + account_id = (known after apply)
      + arn        = (known after apply)
      + id         = (known after apply)
      + user_id    = (known after apply)
    }

  # module.loki-stack.module.iam_assumable_role_loki.data.aws_iam_policy_document.assume_role_with_oidc[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "assume_role_with_oidc" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRoleWithWebIdentity",
            ]
          + effect  = "Allow"

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "system:serviceaccount:loki-stack:loki-stack",
                ]
              + variable = "oidc.eks.eu-west-1.amazonaws.com/id/D7DC5E8CB4D65FF7923BA5975B6622E3:sub"
            }

          + principals {
              + identifiers = [
                  + (known after apply),
                ]
              + type        = "Federated"
            }
        }
    }

  # module.loki-stack.module.iam_assumable_role_loki.data.aws_partition.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_partition" "current" {
      + dns_suffix         = (known after apply)
      + id                 = (known after apply)
      + partition          = (known after apply)
      + reverse_dns_prefix = (known after apply)
    }

  # module.loki-stack.module.iam_assumable_role_loki.aws_iam_role.this[0] will be updated in-place
  ~ resource "aws_iam_role" "this" {
      ~ assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRoleWithWebIdentity"
                      - Condition = {
                          - StringEquals = {
                              - "oidc.eks.eu-west-1.amazonaws.com/id/D7DC5E8CB4D65FF7923BA5975B6622E3:sub" = "system:serviceaccount:loki-stack:loki-stack"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Federated = "arn:aws:iam::047488060046:oidc-provider/oidc.eks.eu-west-1.amazonaws.com/id/D7DC5E8CB4D65FF7923BA5975B6622E3"
                        }
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        id                    = "loki-gh-v1-cluster"
        name                  = "loki-gh-v1-cluster"
        tags                  = {}
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.loki-stack.module.loki-stack.data.utils_deep_merge_yaml.values will be read during apply
  # (config refers to values not yet known)
 <= data "utils_deep_merge_yaml" "values" {
      + id     = (known after apply)
      + input  = [
          + jsonencode({}),
          + (known after apply),
        ]
      + output = (known after apply)
    }

  # module.loki-stack.module.loki-stack.argocd_application.this will be updated in-place
  ~ resource "argocd_application" "this" {
        id      = "loki-stack"
        # (2 unchanged attributes hidden)

      ~ spec {
            # (2 unchanged attributes hidden)

          ~ source {
                # (3 unchanged attributes hidden)

              ~ helm {
                  ~ values      = <<-EOT
                        loki-stack:
                          loki:
                            config:
                              schema_config:
                                configs:
                                - from: "2020-10-24"
                                  index:
                                    period: 24h
                                    prefix: index_
                                  object_store: s3
                                  schema: v11
                                  store: boltdb-shipper
                              storage_config:
                                aws:
                                  s3: s3://eu-west-1/terraform-20221026062129777100000012
                                boltdb_shipper:
                                  active_index_directory: /data/loki/index
                                  cache_location: /data/loki/boltdb-cache
                                  shared_store: s3
                            serviceAccount:
                              annotations:
                                eks.amazonaws.com/role-arn: arn:aws:iam::047488060046:role/loki-gh-v1-cluster
                    EOT -> (known after apply)
                    # (2 unchanged attributes hidden)
                }
            }

            # (2 unchanged blocks hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.loki-stack.module.loki-stack.null_resource.dependencies will be updated in-place
  ~ resource "null_resource" "dependencies" {
        id       = "5340850951291533045"
      + triggers = {}
    }

  # module.prometheus-stack.module.kube-prometheus-stack.data.utils_deep_merge_yaml.values will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "utils_deep_merge_yaml" "values" {
      + id     = (known after apply)
      + input  = [
          + (sensitive),
          + <<-EOT
                "kube-prometheus-stack":
                  "prometheus":
                    "serviceAccount":
                      "annotations":
                        "eks.amazonaws.com/role-arn": "arn:aws:iam::047488060046:role/thanos-s3-role-gh-v1-cluster"
            EOT,
        ]
      + output = (known after apply)
    }

  # module.prometheus-stack.module.kube-prometheus-stack.argocd_application.this will be updated in-place
  ~ resource "argocd_application" "this" {
        id      = "kube-prometheus-stack"
        # (2 unchanged attributes hidden)

      ~ spec {
            # (2 unchanged attributes hidden)

          ~ source {
                # (3 unchanged attributes hidden)

              ~ plugin {
                    name = "kustomized-helm"

                  - env {
                      - name  = "HELM_VALUES" -> null
                      - value = <<-EOT
                            kube-prometheus-stack:
                              alertmanager:
                                alertmanagerSpec:
                                  containers:
                                  - args:
                                    - --http-address=0.0.0.0:9095
                                    - --upstream=http://localhost:9093
                                    - --provider=oidc
                                    - --oidc-issuer-url=https://cognito-idp.eu-west-1.amazonaws.com/eu-west-1_w8ryL2viU
                                    - --client-id=3t7k2brrenpkkgijrkica0rsdb
                                    - --client-secret=120tunnu16bgb4brbqi0coh6of1bq7cvv6s2h8g1q1gqgmlphbl9
                                    - --cookie-secure=false
                                    - --cookie-secret=UTYmLlGHqQ2utCUK
                                    - --email-domain=*
                                    - --redirect-url=https://alertmanager.apps.gh-v1-cluster.is-sandbox.camptocamp.com/oauth2/callback
                                    image: quay.io/oauth2-proxy/oauth2-proxy:v7.1.3
                                    name: alertmanager-proxy
                                    ports:
                                    - containerPort: 9095
                                      name: web
                                  initContainers:
                                  - args:
                                    - |
                                      until curl -skL -w "%{http_code}\\n" "https://gh-v1-cluster.auth.eu-west-1.amazoncognito.com/oauth2/userInfo" -o /dev/null | grep -vq "^\(000\|404\)$"; do echo "waiting for oidc at https://gh-v1-cluster.auth.eu-west-1.amazoncognito.com/oauth2/userInfo"; sleep 2; done
                                    command:
                                    - /bin/sh
                                    - -c
                                    image: curlimages/curl:7.79.1
                                    name: wait-for-oidc
                                enabled: true
                                ingress:
                                  annotations:
                                    cert-manager.io/cluster-issuer: letsencrypt-staging
                                    ingress.kubernetes.io/ssl-redirect: "true"
                                    kubernetes.io/ingress.allow-http: "false"
                                    traefik.ingress.kubernetes.io/router.entrypoints: websecure
                                    traefik.ingress.kubernetes.io/router.middlewares: traefik-withclustername@kubernetescrd
                                    traefik.ingress.kubernetes.io/router.tls: "true"
                                  enabled: true
                                  hosts:
                                  - alertmanager.apps.gh-v1-cluster.is-sandbox.camptocamp.com
                                  - alertmanager.apps.is-sandbox.camptocamp.com
                                  tls:
                                  - hosts:
                                    - alertmanager.apps.gh-v1-cluster.is-sandbox.camptocamp.com
                                    - alertmanager.apps.is-sandbox.camptocamp.com
                                    secretName: alertmanager-tls
                                service:
                                  targetPort: 9095
                                serviceMonitor:
                                  selfMonitor: false
                              grafana:
                                additionalDataSources:
                                - access: proxy
                                  isDefault: true
                                  jsonData:
                                    oauthPassThru: true
                                    tlsAuth: false
                                    tlsAuthWithCACert: false
                                  name: Thanos
                                  type: prometheus
                                  url: http://thanos-query.thanos:9090
                                enabled: false
                                forceDeployDashboards: true
                                forceDeployDatasources: true
                                sidecar:
                                  datasources:
                                    defaultDatasourceEnabled: false
                              prometheus:
                                additionalPodMonitors:
                                - name: alertmanager
                                  namespaceSelector:
                                    matchNames:
                                    - kube-prometheus-stack
                                  podMetricsEndpoints:
                                  - path: /metrics
                                    targetPort: 9093
                                  selector:
                                    matchLabels:
                                      alertmanager: kube-prometheus-stack-alertmanager
                                      app: alertmanager
                                - name: prometheus
                                  namespaceSelector:
                                    matchNames:
                                    - kube-prometheus-stack
                                  podMetricsEndpoints:
                                  - path: /metrics
                                    targetPort: 9090
                                  selector:
                                    matchLabels:
                                      app: prometheus
                                      prometheus: kube-prometheus-stack-prometheus
                                enabled: true
                                ingress:
                                  annotations:
                                    cert-manager.io/cluster-issuer: letsencrypt-staging
                                    ingress.kubernetes.io/ssl-redirect: "true"
                                    kubernetes.io/ingress.allow-http: "false"
                                    traefik.ingress.kubernetes.io/router.entrypoints: websecure
                                    traefik.ingress.kubernetes.io/router.middlewares: traefik-withclustername@kubernetescrd
                                    traefik.ingress.kubernetes.io/router.tls: "true"
                                  enabled: true
                                  hosts:
                                  - prometheus.apps.gh-v1-cluster.is-sandbox.camptocamp.com
                                  - prometheus.apps.is-sandbox.camptocamp.com
                                  tls:
                                  - hosts:
                                    - prometheus.apps.gh-v1-cluster.is-sandbox.camptocamp.com
                                    - prometheus.apps.is-sandbox.camptocamp.com
                                    secretName: prometheus-tls
                                prometheusSpec:
                                  alertingEndpoints:
                                  - name: kube-prometheus-stack-alertmanager
                                    namespace: kube-prometheus-stack
                                    port: 9093
                                  containers:
                                  - args:
                                    - --http-address=0.0.0.0:9091
                                    - --upstream=http://localhost:9090
                                    - --provider=oidc
                                    - --oidc-issuer-url=https://cognito-idp.eu-west-1.amazonaws.com/eu-west-1_w8ryL2viU
                                    - --client-id=3t7k2brrenpkkgijrkica0rsdb
                                    - --client-secret=120tunnu16bgb4brbqi0coh6of1bq7cvv6s2h8g1q1gqgmlphbl9
                                    - --cookie-secure=false
                                    - --cookie-secret=UTYmLlGHqQ2utCUK
                                    - --email-domain=*
                                    - --redirect-url=https://prometheus.apps.gh-v1-cluster.is-sandbox.camptocamp.com/oauth2/callback
                                    image: quay.io/oauth2-proxy/oauth2-proxy:v7.1.3
                                    name: prometheus-proxy
                                    ports:
                                    - containerPort: 9091
                                      name: proxy
                                  externalLabels:
                                    prometheus: prometheus-gh-v1-cluster
                                  initContainers:
                                  - args:
                                    - |
                                      until curl -skL -w "%{http_code}\\n" "https://gh-v1-cluster.auth.eu-west-1.amazoncognito.com/oauth2/userInfo" -o /dev/null | grep -vq "^\(000\|404\)$"; do echo "waiting for oidc at https://gh-v1-cluster.auth.eu-west-1.amazoncognito.com/oauth2/userInfo"; sleep 2; done
                                    command:
                                    - /bin/sh
                                    - -c
                                    image: curlimages/curl:7.79.1
                                    name: wait-for-oidc
                                  portName: proxy
                                  thanos:
                                    objectStorageConfig:
                                      key: thanos.yaml
                                      name: thanos-objectstorage
                                service:
                                  additionalPorts:
                                  - name: web
                                    port: 9090
                                    targetPort: 9090
                                  port: 9091
                                  targetPort: 9091
                                serviceAccount:
                                  annotations:
                                    eks.amazonaws.com/role-arn: arn:aws:iam::047488060046:role/thanos-s3-role-gh-v1-cluster
                                serviceMonitor:
                                  selfMonitor: false
                                thanosService:
                                  enabled: true
                        EOT -> null
                    }
                  + env {
                      + name  = "HELM_VALUES"
                      + value = (known after apply)
                    }
                }
            }

            # (2 unchanged blocks hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.prometheus-stack.module.kube-prometheus-stack.null_resource.dependencies will be updated in-place
  ~ resource "null_resource" "dependencies" {
        id       = "8219277364723472454"
      + triggers = {}
    }

  # module.thanos.module.thanos.argocd_application.this will be updated in-place
  ~ resource "argocd_application" "this" {
        id      = "thanos"
        # (2 unchanged attributes hidden)

      ~ spec {
            # (2 unchanged attributes hidden)

          ~ source {
              ~ target_revision = "v1.0.0-rc2" -> "v1.0.0-alpha.4"
                # (2 unchanged attributes hidden)

                # (1 unchanged block hidden)
            }

            # (2 unchanged blocks hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.thanos.module.thanos.null_resource.dependencies will be updated in-place
  ~ resource "null_resource" "dependencies" {
        id       = "2401975945002650052"
      + triggers = {}
    }

  # module.ingress.module.traefik.module.traefik.null_resource.dependencies will be updated in-place
  ~ resource "null_resource" "dependencies" {
        id       = "2267520950021390830"
      + triggers = {}
    }

Plan: 0 to add, 20 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>

*Pushed by: @lentidas, Action: `pull_request`, Working Directory: ``, Workflow: `Automatic terraform plan on PR`*